OFtutorial12_momentumSource/testCase/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actuationDisk
{
    type customActuationDiskSource;

    upstreamPoint (-1.5 0 0);
    diskDir (-1.0 0.5 0);
    diskCentre (0 0 0);
    D 1;
    thickness 0.1;
    Cp 0.386;
    Ct 0.58;

    fields (U);
}


// ************************************************************************* //
